23250/examples/1.xml

<!-- Клиент снимает со счета в долларах рубли. 
Валютная пара у нас USDRUB. USD – базовая (currency1), RUB – котируемая (currency2). 
В этом случае банк покупает у клиента доллары за рубли и мы выбираем курс bid. -->

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:jour="http://journal.ws.spectrum" xmlns:xsd="http://model.ws.spectrum/xsd">
   <soap:Header/>
   <soap:Body>
      <jour:create>
         <jour:request>
            <xsd:operationEntity>
               <xsd:client>
                  <xsd:clientTypeEnum>0</xsd:clientTypeEnum>
                  <xsd:clientExtId>****-**-siebel</xsd:clientExtId>
                  <xsd:clientIdSys>SBL_FR</xsd:clientIdSys>
                  <xsd:icIssueAutority>*** ОВД Т******* р***** г***** М***** кп 7**-1**</xsd:icIssueAutority>
                  <xsd:icIssueDate>2***-**-**</xsd:icIssueDate>
                  <xsd:icNum>7*****</xsd:icNum>
                  <xsd:icSeries>6***</xsd:icSeries>
                  <xsd:identityCardTypeId>2*</xsd:identityCardTypeId>
                  <xsd:personFirstName>А*****</xsd:personFirstName>
                  <xsd:personPatronymic>Ю*******</xsd:personPatronymic>
                  <xsd:personSurname>З*******</xsd:personSurname>
                  <xsd:personCitizenCountryCode>643</xsd:personCitizenCountryCode>
                  <!--<xsd:personStatelessFlag></xsd:personStatelessFlag>-->
               </xsd:client>
               <xsd:deptCode>1126</xsd:deptCode>
               <xsd:operJournalStatusEnum>3</xsd:operJournalStatusEnum>
               <xsd:extFee>
                  <xsd:currency>USD</xsd:currency>
                  <xsd:summa>77</xsd:summa>
               </xsd:extFee>
               <xsd:documents>
                  <xsd:analyticAttributes>
                     <xsd:code>CBO_CODE</xsd:code>
                     <xsd:value>711110-00</xsd:value>
                  </xsd:analyticAttributes>
                  <xsd:cashSymbols>
                     <xsd:cashSymbolCode>51</xsd:cashSymbolCode>
                     <xsd:summa>
                        <xsd:currency>RUB</xsd:currency>
                        <xsd:summa>32250</xsd:summa>
                     </xsd:summa>
                  </xsd:cashSymbols>
                  <xsd:creditSumma>
                     <xsd:currency>RUB</xsd:currency>
                     <xsd:summa>32250</xsd:summa>
                  </xsd:creditSumma>
                  <xsd:debitAccountEntity>
                     <xsd:accountIdSys>99995</xsd:accountIdSys>
                     <xsd:accountNum>40817840************</xsd:accountNum>
                     <xsd:deptCode>1056</xsd:deptCode>
                  </xsd:debitAccountEntity>
                  <xsd:debitSumma>
                     <xsd:currency>USD</xsd:currency>
                     <xsd:summa>500</xsd:summa>
                  </xsd:debitSumma>
                  <xsd:description>Снятие наличных с банковского счета
                     На основании: договор No 40817840************</xsd:description>
                  <xsd:docNumber>12345</xsd:docNumber>
               </xsd:documents>
               <xsd:login>O1126</xsd:login>
               <xsd:idSys>99995</xsd:idSys>
               <xsd:operJournalExtId>SP.CONP.123123004</xsd:operJournalExtId>
               <xsd:operationCode>1061</xsd:operationCode>
            </xsd:operationEntity>
            <xsd:requestInfo>
               <xsd:messageId>123123004</xsd:messageId>
            </xsd:requestInfo>
         </jour:request>
      </jour:create>
   </soap:Body>
</soap:Envelope>